////////////////////////////////////////////////////////////////////////////
//
// Copyright (c) 2012-2019 60East Technologies Inc., All Rights Reserved.
//
// This computer software is owned by 60East Technologies Inc. and is
// protected by U.S. copyright laws and other laws and by international
// treaties.  This computer software is furnished by 60East Technologies
// Inc. pursuant to a written license agreement and may be used, copied,
// transmitted, and stored only in accordance with the terms of such
// license agreement and with the inclusion of the above copyright notice.
// This computer software or any other copies thereof may not be provided
// or otherwise made available to any other person.
//
// U.S. Government Restricted Rights.  This computer software: (a) was
// developed at private expense and is in all respects the proprietary
// information of 60East Technologies Inc.; (b) was not developed with
// government funds; (c) is a trade secret of 60East Technologies Inc.
// for all purposes of the Freedom of Information Act; and (d) is a
// commercial item and thus, pursuant to Section 12.212 of the Federal
// Acquisition Regulations (FAR) and DFAR Supplement Section 227.7202,
// Government's use, duplication or disclosure of the computer software
// is subject to the restrictions set forth by 60East Technologies Inc.
//
////////////////////////////////////////////////////////////////////////////

#ifndef _AMPS_SDK_PROTOCOL_AMPS_PROTOCOL_H_

#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_ACK_TYPE_MASK          (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_ACK_TYPE)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_SUB_ID_MASK            (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_SUB_ID)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_STATUS_MASK            (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_STATUS)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_REASON_MASK            (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_REASON)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_QUERY_ID_MASK          (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_QUERY_ID)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_BATCH_SIZE_MASK        (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_BATCH_SIZE)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_TOPIC_MATCHES_MASK     (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_TOPIC_MATCHES)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_MATCHES_MASK           (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_MATCHES)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_GROUP_SEQ_NUM_MASK     (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_GROUP_SEQ_NUM)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_PASSWORD_MASK          (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_PASSWORD)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_OPTIONS_MASK           (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_OPTIONS)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_RECORDS_DELETED_MASK   (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_RECORDS_DELETED)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_RECORDS_RETURNED_MASK  (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_RECORDS_RETURNED)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_RECORDS_INSERTED_MASK  (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_RECORDS_INSERTED)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_RECORDS_UPDATED_MASK   (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_RECORDS_UPDATED)
#define AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_VERSION_MASK           (0x1UL << AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_VERSION)

inline uint64_t amps_output_message_header_field_mask(uint64_t fieldId_)
{
  return 0x1UL << fieldId_;
}

inline void amps_output_message_header_field_mask_set(uint64_t& bitmask_, uint64_t mask_)
{
  bitmask_ |= mask_;
}

inline void amps_output_message_header_field_mask_unset(uint64_t& bitmask_, uint64_t mask_)
{
  bitmask_ &= ~mask_;
}

///
/// AMPS protocol 'chunk message' return codes
///

/// indicates that a complete message is avaible for delivery into AMPS
#define AMPS_PROTOCOL_COMPLETE_MESSAGE    1
/// indicates that there are not enough bytes to form a complete message
#define AMPS_PROTOCOL_INCOMPLETE_MESSAGE  0
/// a protocol error has been detected when trying to form a message
#define AMPS_PROTOCOL_ERROR              -1

struct amps_protocol_chunk;

/// reserve count_ messages inside amps_protocol_chunk. if a
/// reallocation is required then existing array will be memcpy'd
typedef int (*amps_protocol_chunk_message_reserve_function)(size_t count_, amps_protocol_chunk*);

struct amps_protocol_output_buffer
{
  void*   handle;
  char*   data;
  size_t  byte_count;
  size_t  allocated_byte_count;
};

typedef void (*amps_protocol_output_buffer_reserve_function)(amps_protocol_output_buffer*, size_t);

struct amps_protocol_deflate_request
{
  /// the protocol context as returned by the protocol create_context function
  amps_protocol_context                         protocol_context;
  /// the opaque protocol impl handle that can be casted to a protocol implemention pointer
  amps_protocol_impl_handle                     protocol_handle;
  /// the protocol client handle created via the create_client function
  amps_protocol_client_handle                   protocol_client_handle;
  size_t                                        input_byte_count;     // byte count for all input_data segments
  size_t                                        input_segment_count;  // the number of 'input' segments
  const amps_byte_array*                        input_data;           // the segments of data for all messages
  amps_protocol_output_buffer_reserve_function  output_buffer_reserve;
  amps_protocol_output_buffer                   output_buffer;
  size_t                                        consumed_byte_count;
  size_t                                        consumed_segment_count; // must consume whole segments
};

/// deflate function that can be specified in the handshake
typedef int (*amps_protocol_deflate_function)(amps_protocol_deflate_request*);

// a protocol message is produced inside the protocol 'chunk function'
// and indicates the bounaries of a complete message that will be
// delivered into AMPS.
struct amps_protocol_message
{
  /// pointer to the start of the message bytes
  const char*               data;
  /// length of the message
  size_t                    byte_count;
  amps_protocol_command_id  command_id;
};

/// prototype for a function used by the transport to create options
/// that are passed to the transport logon function.  the protocol
/// will use the allocation function to allocate the bytes to hold the
/// options string. the options string will be in 'json' format.

typedef void* (*amps_protocol_options_allocate_function)(size_t byteCount_, size_t* allocatedByteCount_);

struct amps_protocol_options
{
  /// allocator to be used to allocate bytes to hold the options
  amps_protocol_options_allocate_function   allocate;
  /// pointer to the start of the options
  const char*                               data;
  /// the length of the options
  size_t                                    byte_count;
  /// the number of bytes allocated for the options
  size_t                                    allocated_byte_count;
};

/// prototype for a function used by the transport to create a
/// response message. if a response is required then allocator is used
/// to allocate the bytes for the response message.

typedef void* (*amps_protocol_response_allocate_function)(size_t byteCount_, size_t* allocatedByteCount_);

struct amps_protocol_response
{
  /// allocator to be used to allocate bytes to hold a response message
  amps_protocol_response_allocate_function  allocate;
  /// pointer to the start of the response message
  const char*                               data;
  /// the length of the response message
  size_t                                    byte_count;
  /// the number of bytes allocated for the response
  size_t                                    allocated_byte_count;
};

/// a amps_protocol_create_client_params struct is passed to the
/// protocol client create function and contains information regarding
/// the client. the connect_preamble can be used by the protocol
/// create_client function to convey a response that can be set back
/// to the client.
struct amps_protocol_create_client_params
{
  /// the protocol context as returned by the protocol create_context function
  amps_protocol_context   protocol_context;
  /// description of the client, i.e. "peername -> localname"
  const char*             client_description;
  /// length of the description
  size_t                  client_description_length;
  /// the client name as set by AMPS
  const char*             client_name;
  /// the length the client name
  size_t                  client_name_length;
  /// AMPS_TRANSPORT_INBOUND_CLIENT or AMPS_TRANSPORT_OUTBOUND_CLIENT
  uint64_t                direction;
  // can be set by AMPS via protocol to indicate that upon connect a string should be sent to client
  amps_protocol_response  connect_preamble;
};

/// a protocol chunk is produced inside the protocol 'chunk function'
/// and includes 1 or more complete messages that will be delivered
/// into AMPS.
struct amps_protocol_chunk
{
  /// the protocol context as returned by the protocol create_context function
  amps_protocol_context                         protocol_context;
  /// the opaque protocol impl handle that can be casted to a protocol implemention pointer
  amps_protocol_impl_handle                     protocol_handle;
  /// the protocol client handle created via the create_client function
  amps_protocol_client_handle                   protocol_client_handle;
  /// pointer to the start of the input data
  const char*                                   input_data;
  /// the length of the input data
  size_t                                        input_byte_count;

  /// response message to be delivered (and freed) if allocated and set
  amps_protocol_response                        response;

  /// reserve function to be called when 'allocated' is not large
  /// enough to hold the number of messages produced in a chunk
  amps_protocol_chunk_message_reserve_function  reserve;
  /// allocated_count is the max number of messages available to be
  /// filled in during the 'chunk' function. reserve can be called to
  /// get additional messages.
  size_t                                        allocated_count;
  /// number of bytes that were consumed to form the messages
  size_t                                        consumed_byte_count;
  /// if the segment_count is non-zero then message_count will be 1
  /// and the messages should be considered a 'gather list' that forms
  /// a single message
  size_t                                        segment_count;
  /// if the segment_count is non-zero then segments_byte_count is the
  /// number of bytes for all segments
  size_t                                        segments_byte_count;
  /// number of messages to be processed
  size_t                                        message_count;
  /// an array of messages to be processed
  amps_protocol_message*                        messages;
};

/// a structure that represents a protocol handshake. a handshake
/// structure is passed into the protocol handshake function and it
/// may or may not fill in the response fields.
struct amps_protocol_handshake
{
  /// the protocol context as returned by the protocol create_context function
  amps_protocol_context                     protocol_context;
  /// the opaque protocol impl handle that can be casted to a protocol implemention pointer
  amps_protocol_impl_handle                 protocol_handle;
  /// the protocol client handle created via the create_client function
  amps_protocol_client_handle               protocol_client_handle;
  /// pointer to the start of the input data
  const char*                               input_data;
  /// the length of the input data
  size_t                                    input_byte_count;
  /// the number of bytes consumed processing the handshake
  size_t                                    consumed_byte_count;
  /// response message to be delivered (and freed) if allocated and set
  amps_protocol_response                    response;
  /// options to be passed to the transport logon function (allocated and set by the handshake function)
  amps_protocol_options                     options;
  /// set by the handshake when deflate is requested at the protocol level
  amps_protocol_deflate_function            deflate;
};

/// a structure that represents a protocol logon_complete. a logon
/// complete structure is passed into the protocol logon_complete
/// function after the transport executes the logon requested in the
/// handshake and it may or may not fill in the response fields.
struct amps_protocol_logon_completion
{
  /// the protocol context as returned by the protocol create_context function
  amps_protocol_context                     protocol_context;
  /// the opaque protocol impl handle that can be casted to a protocol implemention pointer
  amps_protocol_impl_handle                 protocol_handle;
  /// the protocol client handle created via the create_client function
  amps_protocol_client_handle               protocol_client_handle;
  /// the return code from the transport logon call
  int                                       logon_status;
  /// logon options created in the transport logon function and passed to the logon_completion function
  amps_protocol_options*                    logon_options;
  /// response message to be delivered (and freed) if allocated and set
  amps_protocol_response                    response;
  amps_protocol_handshake*                  handshake;
};

/// a structure that represents a protocol header field. each header
/// field shall have a type, a field id and a value. the value union
/// will be set in accordance with the type of field. for strings, the
/// length data member will contain the length of the string.
struct amps_output_message_header_field
{
  /// the type of the header field
  uint8_t  type;
  uint8_t  reserved;
  /// the header field identifier
  uint16_t field_id;
  /// the length when the type is 'string' limited to 4GB
  uint32_t length;
  union
  {
    /// the start of the data for a string value
    const char* s;
    /// a double value
    double      f;
    /// an signed 64 bit integer value
    int64_t     i;
    /// an unsigned 64 bit integer value
    uint64_t    u;
    /// an unsigned 8 bit integer value used for booleans
    uint8_t     b;
  } value;
};

/// a structure to hold an array of header fields passed to the
/// protocol serialization functions.
struct amps_output_message_header
{
  /// the protocol context as returned by the protocol create_context function
  amps_protocol_context            protocol_context;           // 8
  /// the opaque protocol impl handle that can be casted to a protocol implemention pointer
  amps_protocol_impl_handle        protocol_handle;            // 16
  /// the protocol client handle created via the create_client function
  amps_protocol_client_handle      protocol_client_handle;
  /// the protocol_command_id for the command otherwise 0 (used for ack and group serialization)
  amps_protocol_command_id         protocol_command_id;        // 24
  /// a bit mask where 0x1<<field_id is set for each field that is valid
  uint64_t                         field_mask;                 // 32
  /// the number of fields in field_mask that are set
  uint64_t                         field_count;                // 40
  /// the max byte count for field values
  uint32_t                         field_max_byte_count;       // 44
  /// set by the protocol 'compute_serialize_size' function
  uint32_t                         serialize_size;             // 48
  // the following fields are for internal protocol publish and oof messages
  uint64_t                         topic_hash;                 // 56
  uint64_t                         sow_key;                    // 64
  int64_t                          timestamp;                  // 8
  uint16_t                         command_type;               // 10
  uint16_t                         ack_type;                   // 12
  uint16_t                         oof_reason;                 // 14
  uint16_t                         flags;                      // 16
  uint64_t                         sow_batch_count;            // 24
  uint64_t                         client_name_hash;           // 32
  uint64_t                         client_seq;                 // 40
  uint64_t                         reserved1;                  // 48
  amps_output_message_header_field publisher_name;             // 64
  /// an array of header fields where only fields set in the field_mask are valid
  // sizeof(amps_output_message_header_field) == 16
  amps_output_message_header_field fields[AMPS_OUTPUT_MESSAGE_HEADER_FIELD_ID_MAX_FIELDS];
};

/// a structure passed from AMPS to the protocol serialization
/// functions that serves as both input and output wrt producing a
/// message for delivery by AMPS. the serialization functions will be
/// passed a protocol output message with the allocation,
/// protocol_context, protocol_handle, header, request_one and data
/// members set. these values will be used by the serialization
/// functions to build a list of segments in the segment_list member
/// value. the byte_count will also be set to indicate the total
/// number of bytes for all segments in the segment list.
struct amps_protocol_output_message
{
  /// segment allocator to allocate segments for pushing onto segment_list
  amps_message_buffer_allocate_function  allocate;                    // 8
  /// the header fields for the output message
  const amps_output_message_header*      header;                      // 16
  /// set by the serialization function to indicate number of byes in the output message
  size_t                                 byte_count;                  // 24
  /// if true then AMPS is requesting that only one segment be created for the message
  uint32_t                               request_one;                 // 28 - if true only return a single segment
  uint32_t                               reserved1;                   // 32
  uint64_t                               reserved2;                   // 40
  /// a list of segments that compose the output message
  amps_message_segment_list*             segment_list;                // 48
  /// A message type context to pass to the message_type_trace_function.
  amps_message_type_context              message_type_context;        // 56
  /// The message type trace function to call with the message payload.
  amps_message_type_trace_function       message_type_trace_function; // 64
  /// the data for the output message which can be pushed onto the segment_list
  amps_message_segment                   data;                        // 128
};

// a structure passed from AMPS to the protocol sow serialization
// function when AMPS is forming a SOW result.
struct amps_output_message_sow_data
{
  /// segment allocator to allocate a segment to hold the serialized sow data
  amps_message_buffer_allocate_function allocate;                    // 8
  /// the protocol context as returned by the protocol create_context function
  amps_protocol_context                 protocol_context;            // 16
  /// the opaque protocol impl handle that can be casted to a protocol implemention pointer
  amps_protocol_impl_handle             protocol_handle;             // 24
  /// the protocol client handle created via the create_client function
  amps_protocol_client_handle           protocol_client_handle;
  /// a pointer to the start of the sow data
  const char*                           data;                        // 32
  /// AMPS can set the sowkey as either a numeric value or a
  /// string. if sowkey_byte_count is non-zero then use sowkey.s and
  /// sowkey_byte_count otherwise use sowkey.u
  union
  {
    /// a pointer to the start of string based sowkey
    const char* s;
    /// a numeric sow key
    uint64_t    u;
  } sowkey;                                                          // 40
  /// a pointer to the start of the correlation_id
  const char*                           correlation_id;              // 48
  /// the length of the sow data
  uint32_t                              data_byte_count;             // 52
  /// the length of a string based sowkey (if 0 then it is numeric)
  uint32_t                              sowkey_byte_count;           // 56
  /// the length of the correlation_id
  uint32_t                              correlation_id_byte_count;   // 60
  uint32_t                              reserved1;                   // 64
  /// the timestamp of the message (when it was last updated)
  uint64_t                              topic_hash;                  // 72
  /// the timestamp of the message (when it was last updated)
  int64_t                               timestamp;                   // 80
  /// the client name hash of the message bookmark
  uint64_t                              client_name_hash;            // 32
  /// the client seq of the message bookmark
  uint64_t                              client_seq;                  // 40
  /// A message type context to pass to the message_type_trace_function.
  amps_message_type_context             message_type_context;        // 88
  /// The message type trace function to call with the message payload.
  amps_message_type_trace_function      message_type_trace_function; // 96
  /// the output segment that contains the serialized sow data to be part of a SOW response
  amps_message_segment                  segment;                     // 176 where sizeof(amps_message_segment) == 80
};

/// Structure used to pass trace information to a protocol's
/// amps_protocol_trace entry point, specifying the input message to
/// be traced the output buffer to write the trace messasge to, and
/// the message type function that should be chained if a message
/// exists.

/// the max number of segments that can form a trace message
#define AMPS_TRACE_SEGMENT_LIST_MAX_SIZE 3
#define AMPS_TRACE_SEGMENT_LIST_MAX_COUNT 3

struct amps_trace_context
{
  /// A pointer to the first amps_trace_buffer containing input or
  /// output message data to be traced.
  amps_trace_buffer*               buffers;
  /// The size of the array (in elements) buffer_list.
  size_t                           buffer_count;
